Revit 2027 API
BumpMap Class
 A static class that provides access to the property names that appear in the BumpMap visual asset schema.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.BumpMap
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class BumpMap
Public NotInheritable Class BumpMap
public ref class BumpMap abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type BumpMap = class end
The BumpMap type exposes the following members.
Properties
Name | Description
BumpmapBitmap |  The property labeled "Source" from the "BumpMap" schema.
BumpmapDepth |  The property labeled "Amount" from the "BumpMap" schema.
BumpmapNormalScale |  The property labeled "Amount" from the "BumpMap" schema.
BumpmapType |  The property labeled "Bump Type" from the "BumpMap" schema.
TextureLinkTextureTransforms |  The property labeled "Link Transforms" from the "BumpMap" schema.
TextureOffsetLock |  The property labeled "Offset Lock" from the "BumpMap" schema.
TextureRealWorldOffsetX |  The property labeled "Offset X" from the "BumpMap" schema.
TextureRealWorldOffsetY |  The property labeled "Offset Y" from the "BumpMap" schema.
TextureRealWorldScaleX |  The property labeled "Size X" from the "BumpMap" schema.
TextureRealWorldScaleY |  The property labeled "Size Y" from the "BumpMap" schema.
TextureScaleLock |  The property labeled "Scale Lock" from the "BumpMap" schema.
TextureURepeat |  The property labeled "U Repeat" from the "BumpMap" schema.
TextureVRepeat |  The property labeled "V Repeat" from the "BumpMap" schema.
TextureWAngle |  The property labeled "Angle" from the "BumpMap" schema.
Top
See Also
Reference
Autodesk.Revit.DB.Visual Namespace